chartref/old/mongodbcluster1/d/rc1000-op1000/tc12/run2.txt
/usr/lib/jvm/java-11-openjdk-11.0.4.11-0.el7_6.x86_64//bin/java  -classpath /mnt/hdd2/nosql-prj/YCSB/YCSB/conf:/mnt/hdd2/nosql-prj/YCSB/YCSB/core/target/core-0.17.0-SNAPSHOT.jar:/mnt/hdd2/nosql-prj/YCSB/YCSB/mongodb/target/mongodb-binding-0.17.0-SNAPSHOT.jar:/mnt/hdd2/nosql-prj/YCSB/YCSB/mongodb/target/dependency/HdrHistogram-2.1.9.jar:/mnt/hdd2/nosql-prj/YCSB/YCSB/mongodb/target/dependency/htrace-core4-4.2.0-incubating.jar:/mnt/hdd2/nosql-prj/YCSB/YCSB/mongodb/target/dependency/logback-classic-1.1.2.jar:/mnt/hdd2/nosql-prj/YCSB/YCSB/mongodb/target/dependency/logback-core-1.1.2.jar:/mnt/hdd2/nosql-prj/YCSB/YCSB/mongodb/target/dependency/mongodb-async-driver-2.0.1.jar:/mnt/hdd2/nosql-prj/YCSB/YCSB/mongodb/target/dependency/mongo-java-driver-3.8.0.jar:/mnt/hdd2/nosql-prj/YCSB/YCSB/mongodb/target/dependency/slf4j-api-1.7.25.jar:/mnt/hdd2/nosql-prj/YCSB/YCSB/mongodb/target/dependency/snappy-java-1.1.7.1.jar com.yahoo.ycsb.Client -t -db com.yahoo.ycsb.db.MongoDbClient -s -p mongodb.url=mongodb://172.16.13.26:27021 -P /mnt/hdd2/nosql-prj/YCSB/YCSB/workloads/workloadd -p recordcount=1000 -threads 12 -p operationcount=1000
mongo client connection created with mongodb://172.16.13.26:27021
[OVERALL], RunTime(ms), 609
[OVERALL], Throughput(ops/sec), 1642.0361247947455
[TOTAL_GCS_G1_Young_Generation], Count, 1
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 6
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.9852216748768473
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 1
[TOTAL_GC_TIME], Time(ms), 6
[TOTAL_GC_TIME_%], Time(%), 0.9852216748768473
[READ], Operations, 959
[READ], AverageLatency(us), 3220.711157455683
[READ], MinLatency(us), 1435
[READ], MaxLatency(us), 52863
[READ], 95thPercentileLatency(us), 4739
[READ], 99thPercentileLatency(us), 52415
[READ], Return=OK, 959
[CLEANUP], Operations, 12
[CLEANUP], AverageLatency(us), 385.1666666666667
[CLEANUP], MinLatency(us), 0
[CLEANUP], MaxLatency(us), 4619
[CLEANUP], 95thPercentileLatency(us), 3
[CLEANUP], 99thPercentileLatency(us), 4619
[INSERT], Operations, 41
[INSERT], AverageLatency(us), 2984.2195121951218
[INSERT], MinLatency(us), 1707
[INSERT], MaxLatency(us), 12599
[INSERT], 95thPercentileLatency(us), 4819
[INSERT], 99thPercentileLatency(us), 12599
[INSERT], Return=OK, 41